# 3. Вывести на экран числа от -N до N

n = int(input('Введите  число '))
ran = range(-n, n+1)
for i in ran:
	print(i)
	