# 21. Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1



str_lst = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
search_str = "qwe"

pos = []
for i, x in enumerate(str_lst):
    if x == search_str:
        pos.append(i)
if str_lst == [] or pos == [] or len(pos) == 1:
	print('-1')
# print(pos)

for j, y in enumerate(pos):
    if 0 < j < 2:
        print(y)
 