# 29. Найти НОК двух чисел
    # НОК (a, b) = a * b / НОД (a, b)
    # НОД (a, b) = НОД (b, с), где с — остаток от деления a на b.
        # 140 : 96 = 1 (остаток 44)
        # 96 : 44 = 2 (остаток 8)
        # 44 : 8 = 5 (остаток 4)
        # 8 : 4 = 2

def NOD(a, b):
    if a < b:
        a, b = b, a # в a кладем наибольшее значение
    while b != 0: 
        c = a % b
        a = b
        b = c
    return a

a = 140
b = 96
nok = (a * b) / NOD(a, b)
    
print(nok)
